const express = require("express");
const http = require("http");
const { Server } = require("socket.io");

const app = express();
const server = http.createServer(app);

const io = new Server(server,{
    cors:{
        origin:"*"
    }
});

//////////////////////////////////////////////////////
// ルーム管理
//////////////////////////////////////////////////////

const rooms = {};

//////////////////////////////////////////////////////
// 接続
//////////////////////////////////////////////////////

io.on("connection",(socket)=>{

    console.log("接続:",socket.id);

    //////////////////////////////////////////////////
    // ルーム作成
    //////////////////////////////////////////////////

    socket.on("createRoom",(data)=>{

        const { roomId,password } = data;

        //////////////////////////////////////////////////
        // 既に存在
        //////////////////////////////////////////////////

        if(rooms[roomId]){

            socket.emit("roomError",
                "既に存在するルームID"
            );

            return;
        }

        //////////////////////////////////////////////////
        // 作成
        //////////////////////////////////////////////////

        rooms[roomId] = {

            password,
            players:{}
        };

        //////////////////////////////////////////////////
        // Socket.IO room参加
        //////////////////////////////////////////////////

        socket.join(roomId);

        //////////////////////////////////////////////////
        // socket情報保存
        //////////////////////////////////////////////////

        socket.roomId = roomId;

        socket.emit("roomCreated");

        console.log("ルーム作成:",roomId);
    });

    //////////////////////////////////////////////////
    // ルーム参加
    //////////////////////////////////////////////////

    socket.on("joinRoom",(data)=>{

        const { roomId,password } = data;

        //////////////////////////////////////////////////
        // ルーム存在確認
        //////////////////////////////////////////////////

        if(!rooms[roomId]){

            socket.emit(
                "roomError",
                "ルームが存在しません"
            );

            return;
        }

        //////////////////////////////////////////////////
        // パスワード確認
        //////////////////////////////////////////////////

        if(rooms[roomId].password !== password){

            socket.emit(
                "roomError",
                "パスワードが違います"
            );

            return;
        }

        //////////////////////////////////////////////////
        // room参加
        //////////////////////////////////////////////////

        socket.join(roomId);

        socket.roomId = roomId;

        socket.emit("roomJoined");

        console.log("参加:",roomId);
    });

    //////////////////////////////////////////////////
    // 位置更新
    //////////////////////////////////////////////////

    socket.on("updatePosition",(data)=>{

        const roomId = socket.roomId;

        //////////////////////////////////////////////////
        // 未参加
        //////////////////////////////////////////////////

        if(!roomId)return;

        //////////////////////////////////////////////////
        // room存在
        //////////////////////////////////////////////////

        if(!rooms[roomId])return;

        //////////////////////////////////////////////////
        // 保存
        //////////////////////////////////////////////////

        rooms[roomId].players[data.id] = {

    id:data.id,
    socketId:socket.id,

    name:data.name,

    lat:data.lat,
    lng:data.lng,

    heading:data.heading
};

        //////////////////////////////////////////////////
        // 同じroomだけ送信
        //////////////////////////////////////////////////

        io.to(roomId).emit(
            "players",
            Object.values(
                rooms[roomId].players
            )
        );
    });

    //////////////////////////////////////////////////
// ルーム退出
//////////////////////////////////////////////////

socket.on("leaveRoom",()=>{

    const roomId = socket.roomId;

    //////////////////////////////////////////////////
    // 未参加
    //////////////////////////////////////////////////

    if(!roomId)return;

    //////////////////////////////////////////////////
    // room存在確認
    //////////////////////////////////////////////////

    if(!rooms[roomId])return;

    //////////////////////////////////////////////////
    // プレイヤー削除
    //////////////////////////////////////////////////

    for(const id in rooms[roomId].players){

        const player =
        rooms[roomId].players[id];

        if(player.socketId === socket.id){

            delete rooms[roomId].players[id];
        }
    }

    //////////////////////////////////////////////////
    // room退出
    //////////////////////////////////////////////////

    socket.leave(roomId);

    //////////////////////////////////////////////////
    // room情報削除
    //////////////////////////////////////////////////

    socket.roomId = null;

    //////////////////////////////////////////////////
    // 他プレイヤーへ更新通知
    //////////////////////////////////////////////////

    io.to(roomId).emit(
        "players",
        Object.values(
            rooms[roomId].players
        )
    );

    //////////////////////////////////////////////////
    // 空ルーム削除
    //////////////////////////////////////////////////

    if(
        Object.keys(
            rooms[roomId].players
        ).length === 0
    ){

        delete rooms[roomId];
    }

    //////////////////////////////////////////////////
    // 本人へ通知
    //////////////////////////////////////////////////

    socket.emit("roomLeft");

    console.log("退出:",roomId);
});

    //////////////////////////////////////////////////
    // 切断
    //////////////////////////////////////////////////

    socket.on("disconnect",()=>{

        const roomId = socket.roomId;

        if(roomId && rooms[roomId]){

            //////////////////////////////////////////////////
            // プレイヤー削除
            //////////////////////////////////////////////////

            for(const id in rooms[roomId].players){

                if(
                    rooms[roomId]
                    .players[id]
                    .socketId
                    ===
                    socket.id
                ){
                    delete rooms[roomId]
                    .players[id];
                }
            }

            //////////////////////////////////////////////////
            // 空なら削除
            //////////////////////////////////////////////////

            if(
                Object.keys(
                    rooms[roomId].players
                ).length===0
            ){
                delete rooms[roomId];
            }
        }

        console.log("切断:",socket.id);
    });

});

server.listen(3000,()=>{

    console.log("Server Start");
});